{"words2023":[{"word":"emanation","definition":"(1) source, origin (2) being or force which is the manifestation of God","usage":"in an effort to retain the various emanation of his things and himself"},{"word":"deracinated","definition":"uprooted from one's natural geographical, social, or cultural environment.","usage":"deracinated details of Zampano's life"},{"word":"reams","definition":"ream means 500 (formerly 480) sheets of paper. reams of means a lot of.","usage":"there were reams and reams of it"},{"word":"mauled","definition":"treated roughly, handled roughly.","usage":"before I'd pick up another mauled scrap"},{"word":"Braille","definition":"a form of written language for blind people. Book is Brailled. It seems to be capital.","usage":"Almost half of the books he owned were in Braille."},{"word":"graphomaniac","definition":"a compulsive writer","usage":"He's a graphomaniac."},{"word":"adroit","definition":"clever, skillful","usage":"He was adroit at avoiding tax."},{"word":"preadamite","definition":"an inhabitant of the earth before Adam.","usage":"considering the practically preadamite history of the house"},{"word":"desultory","definition":"disappointing in progress, performance, or quality","usage":"and turned the farmboy's temper wolfish, the housewife's desultory"},{"word":"sycophant","definition":"a person who acts obsequiously towards someone important in order to gain advantage.","usage":"because he is high-ranking, he's surrounded by sycophants"},{"word":"nomenclature","definition":"the body or system of names used in a particular specialist field.","usage":"Private nomenclature seems to develop in tight set-upon circles."},{"word":"aphonia","definition":"the loss of the ability to vocalize","usage":"Her near aphonia should have alarmed any adept teacher"},{"word":"vicissitude","definition":"a change of circumstances or fortune, typically one that is unwelcome or unpleasant.","usage":"Vicissitude in Karen's life affected her sensitivity in space."},{"word":"spool","definition":"a cylindrical device on which film, magnetic tape, thread, or other flexible materials can be wound; a reel.","usage":"four spools of fishing line."},{"word":"cavalier","definition":"showing a lack of proper concern; offhand.","usage":"Wax was more cavalier, claiming to have felt no fear."},{"word":"portentious","definition":"attempting to impress by affecting greater importance or merit than is actually possessed.","usage":"It descended into portentious philosophising"},{"word":"clasp","definition":"a device with interlocking parts used for fastening things together.","usage":"and the clasp was in front."},{"word":"knead","definition":"to work and press into a mass with or as if with the hands","usage":"One hand kneading her dress, the other hand under her dress needing herself."},{"word":"ruse","definition":"an action intended to deceive someone; a trick.","usage":"Despite the triumph of Jacob's ruse"},{"word":"bastion","definition":"an institution, place, or person strongly maintaining particular principles, attitudes, or activities.","usage":"Radically altered its previous meaning as bastion or strong gold or safe."},{"word":"basinet","definition":"a light, close-fitting steel helmet, typically having a visor.","usage":"basinet and bassinet are different words."},{"word":"periscope","definition":"An optical instrument consisting of a tube holding a system of lenses and mirrors or prisms.","usage":"Instead, what you'll find here is a periscope."},{"word":"kumquat","definition":"Kumquats or cumquats in Australian English, are a group of small, angiosperm, fruit-bearing trees in the flowering plant family Rutaceae.","usage":"キンカン（金柑）"},{"word":"platitude","definition":"a remark or statement, especially one with a moral content, that has been used too often to be interesting or thoughtful.","usage":"a platitude for every occasion."},{"word":"shibboleth","definition":"a custom, principle, or belief distinguishing a particular class or group of people, especially a long-standing one regarded as outmoded or no longer important.","usage":"It's a shibboleth used to command respect."},{"word":"antipodean","definition":"relating to Australia or New Zealand.","usage":"The antipodean equivalent of the stiff upper lip."},{"word":"wistful","definition":"having or showing a feeling of vague or regretful longing.","usage":"she looks at them wistfully"},{"word":"ado","definition":"a state of agitation or fuss, especially about something unimportant.","usage":"Without further ado, he hurried down the steps."},{"word":"protractor","definition":"an instrument for measuring angles, typically in the form of a flat semicircle marked with degrees along the curved edge.","usage":"分度器"},{"word":"thistle","definition":"アザミ","usage":"I saw you sucking down a thistle top twenty minutes back."},{"word":"incredulous","definition":"unwilling or unable to believe something.","usage":"gives Nick a long stare, of feigned incredulity."},{"word":"pectoral","definition":"relating to the breast or chest.","usage":"an exercise that will help to develop the pectorals is the bench press. pectoral development."},{"word":"gerbil","definition":"a burrowing mouse-like rodent that is specially adapted to living in arid conditions, found in Africa and Asia.","usage":"砂ネズミ"},{"word":"upjohn","definition":"a slang for Benzodazepine (Xanax, Valium, Klonopin)","usage":"He was looking for upjohns off them."},{"word":"craic","definition":"a good time, a fun experience, or a friendly conversation and is commonly used in Irish slang.","usage":"but still having the craic, drinking pints."},{"word":"salient","definition":"of notable significance. prominent.","usage":"The salient point for rhetorical negotiation."},{"word":"visceral","definition":"When something's visceral, you feel it in your guts. A visceral feeling is intuitive.","usage":"while visceral and involving modicum"},{"word":"modicum","definition":"A small amount; just a little; a limited quantity.","usage":"succeed in wrestling a modicum of happiness for yourself."},{"word":"shambles","definition":"a state of total disorder. shambles as a singular noun.","usage":"I'm in a shambles."},{"word":"plait","definition":"a single length of hair, straw, rope, or other material made up of three or more interlaced strands.","usage":"She wore her dark hair in plaits."},{"word":"rivulet","definition":"a small stream of water or another liquid.","usage":"She stood wiping the rivulets of clean water."},{"word":"錐（きり）","definition":"a gimlet (T字型の取手のあるもみぎり), an awl (靴屋などが使う突きぎり), an auger (螺旋型の木工ぎり), a drill　（金属・石などをうがつ, a drill tool, an ice pick","usage":"bore a hole in something with a gimlet."},{"word":"delineate","definition":"describe precisely","usage":"The law should delineate and prohibit behaviour which is socially abhorrent."},{"word":"prosaic","definition":"having or using the style of diction of prose as opposed to poetry. Lacking imaginativeness or originality.","usage":"They're mostly worried about a more prosaic concern."},{"word":"chalice","definition":"a large cup or goblet. The wine cup used in the Christian Eucharist.","usage":"supporting the glass chalice."},{"word":"indenture","definition":"a legal agreement, contract, or document.","usage":"bind him to a seven-year indenture."},{"word":"jonesing","definition":"to have a strong need or desire for something.","usage":"I'm jonesing for a cigarette."},{"word":"obtuse","definition":"annoyingly insensitive or slow to understand.","usage":"He wondered if the doctor was being deliberately obtuse."},{"word":"ipso fact","definition":"by that very fact or act.","usage":"The fact that he was a victim ipso facto meant that he was innocent."},{"word":"sophorific","definition":"tending to induce drowsiness or sleep.","usage":"The motion of the train had a somewhat soporific effect."},{"word":"vacuity","definition":"lack of thought or intelligence; empty-headedness.","usage":"Ben drowned his restlessness in tactile vacuity."},{"word":"tactile","definition":"of or connected with the sense of touch.","usage":"Ben drowned his restlessness in tactile vacuity."},{"word":"tawdry","definition":"showy but cheap and of poor quality.","usage":"tawdry jewellery."},{"word":"emancipation","definition":"the fact or process of being set free from legal, social, or political restrictions; liberation.","usage":"the emancipation of feminist ideas."},{"word":"fastidious","definition":"very attentive to and concerned about accuracy and detail.","usage":"He had a fastidious square moustache."},{"word":"stochastic","definition":"randomly determined; having a random probability distribution or pattern that may be analysed statistically but may not be predicted precisely.","usage":"stochastic processes."},{"word":"hubris","definition":"excessive pride or self-confidence","usage":"Hubris brough down him in the end."},{"word":"privy","definition":"sharing in the knowledge of (something secret or private).","usage":"I wasn't privy to the information."},{"word":"jousts","definition":"a medieval sport in which two opponents on horseback fight with lances.","usage":"The jousts were held in the lists."},{"word":"anon","definition":"soon; shortly.","usage":"I'll be with you anon."},{"word":"appurtenance","definition":"an accessory or other item associated with a particular activity or style of living.","usage":"The appurtenance of the house."},{"word":"ricochet","definition":"rebound off a surface","usage":"Samantha's accusations ricochetted around my head"},{"word":"quorum","definition":"Minimum number of members necessary to constitute the group at a meeting.","usage":"A general meeting of the Owner Cooperation requires a quorum."},{"word":"brazen","definition":"very bold","usage":"They are quite brazen about their sexuality."},{"word":"egregious","definition":"very bad","usage":"the most egregious abuses of human rights."},{"word":"prophylactic","definition":"adj, concerned with preventing disease noun, substance or device to prevent diseases, condom","usage":"the sound of one prophylactic slapping."}]}