{"words2023":[{"word":"emanation","definition":"(1) source, origin (2) being or force which is the manifestation of God","usage":"in an effort to retain the various emanation of his things and himself"},{"word":"deracinated","definition":"uprooted from one's natural geographical, social, or cultural environment.","usage":"deracinated details of Zampano's life"},{"word":"reams","definition":"ream means 500 (formerly 480) sheets of paper. reams of means a lot of.","usage":"there were reams and reams of it"},{"word":"mauled","definition":"treated roughly, handled roughly.","usage":"before I'd pick up another mauled scrap"},{"word":"Braille","definition":"a form of written language for blind people. Book is Brailled. It seems to be capital.","usage":"Almost half of the books he owned were in Braille."},{"word":"graphomaniac","definition":"a compulsive writer","usage":"He's a graphomaniac."},{"word":"adroit","definition":"clever, skillful","usage":"He was adroit at avoiding tax."},{"word":"preadamite","definition":"an inhabitant of the earth before Adam.","usage":"considering the practically preadamite history of the house"},{"word":"desultory","definition":"disappointing in progress, performance, or quality","usage":"and turned the farmboy's temper wolfish, the housewife's desultory"},{"word":"sycophant","definition":"a person who acts obsequiously towards someone important in order to gain advantage.","usage":"because he is high-ranking, he's surrounded by sycophants"},{"word":"nomenclature","definition":"the body or system of names used in a particular specialist field.","usage":"Private nomenclature seems to develop in tight set-upon circles."},{"word":"aphonia","definition":"the loss of the ability to vocalize","usage":"Her near aphonia should have alarmed any adept teacher"},{"word":"vicissitude","definition":"a change of circumstances or fortune, typically one that is unwelcome or unpleasant.","usage":"Vicissitude in Karen's life affected her sensitivity in space."},{"word":"spool","definition":"a cylindrical device on which film, magnetic tape, thread, or other flexible materials can be wound; a reel.","usage":"four spools of fishing line."},{"word":"cavalier","definition":"showing a lack of proper concern; offhand.","usage":"Wax was more cavalier, claiming to have felt no fear."},{"word":"portentious","definition":"attempting to impress by affecting greater importance or merit than is actually possessed.","usage":"It descended into potentious philosophising"},{"word":"clasp","definition":"a device with interlocking parts used for fastening things together.","usage":"and the clasp was in front."},{"word":"knead","definition":"to work and press into a mass with or as if with the hands","usage":"One hand kneading her dress, the other hand under her dress needing herself."},{"word":"ruse","definition":"an action intended to deceive someone; a trick.","usage":"Despite the triumph of Jacob's ruse"},{"word":"bastion","definition":"an institution, place, or person strongly maintaining particular principles, attitudes, or activities.","usage":"Radically altered its previous meaning as bastion or strong gold or safe."},{"word":"basinet","definition":"a light, close-fitting steel helmet, typically having a visor.","usage":"basinet and bassinet are different words."}]}